<template>
  <q-page style="background: rgb(111 118 207);" class="flex flex-center">
    <svg @click="goTo('home')" width="375px" height="812px" viewBox="0 0 375 812" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
        <title>signUp</title>
        <defs>
            <rect id="path-1" x="0" y="0" width="375" height="812"></rect>
            <rect id="path-3" x="0" y="0" width="16" height="16"></rect>
            <mask id="mask-4" maskContentUnits="userSpaceOnUse" maskUnits="objectBoundingBox" x="0" y="0" width="16" height="16" fill="white">
                <use xlink:href="#path-3"></use>
            </mask>
            <rect id="path-5" x="0" y="0" width="327" height="50"></rect>
            <mask id="mask-6" maskContentUnits="userSpaceOnUse" maskUnits="objectBoundingBox" x="0" y="0" width="327" height="50" fill="white">
                <use xlink:href="#path-5"></use>
            </mask>
            <rect id="path-7" x="0" y="22" width="327" height="50"></rect>
            <mask id="mask-8" maskContentUnits="userSpaceOnUse" maskUnits="objectBoundingBox" x="0" y="0" width="327" height="50" fill="white">
                <use xlink:href="#path-7"></use>
            </mask>
        </defs>
        <g id="signUp" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <mask id="mask-2" fill="white">
                <use xlink:href="#path-1"></use>
            </mask>
            <use id="Sign-up-(Background/Mask)" fill="#F0F0F2" xlink:href="#path-1"></use>
            <g id="bg" mask="url(#mask-2)" fill="#FFFFFF" fill-rule="nonzero">
                <g transform="translate(0.000000, 159.000000)" id="Rectangle-8">
                    <path d="M375,12 L375,653 L375,653 L0,653 L0,12 C-8.11624501e-16,5.372583 5.372583,1.21743675e-15 12,0 L363,0 C369.627417,5.58920087e-16 375,5.372583 375,12 Z"></path>
                </g>
            </g>
            <g id="text-copy" mask="url(#mask-2)" font-size="12" font-weight="normal" line-spacing="17">
                <g transform="translate(24.000000, 740.000000)">
                    <text id="이미-가입하셨나요?" font-family="Roboto">
                        <tspan x="0" y="12" fill="#858597">이미</tspan>
                        <tspan x="20.76" y="12" font-family="Helvetica" fill="#858597"> </tspan>
                        <tspan x="24.0939844" y="12" fill="#858597">가입하셨나요?</tspan>
                    </text>
                    <text id="Log-in" font-family="Helvetica" fill-opacity="0" text-decoration="underline">
                        <tspan x="176" y="11" fill="#000000">Log in</tspan>
                    </text>
                </g>
            </g>
            <g id="text-copy-2" mask="url(#mask-2)">
                <g transform="translate(25.000000, 682.000000)">
                    <g id="text" transform="translate(23.000000, 0.000000)" font-family="Roboto" font-size="12" font-weight="normal">
                        <text id="회원약관-동의" fill="#858597">
                            <tspan x="0" y="11">회원약관</tspan>
                            <tspan x="41.52" y="11" font-family="Helvetica"> </tspan>
                            <tspan x="44.8539844" y="11">동의</tspan>
                        </text>
                    </g>
                    <g id="elements/checkBox/off">
                        <path d="M0,0 L16,0 L16,16 L0,16 L0,0 Z" id="elements/checkBox/off-(Background)"></path>
                        <use stroke="#B8B8D2" mask="url(#mask-4)" stroke-width="2" stroke-dasharray="0,0" xlink:href="#path-3"></use>
                    </g>
                </g>
            </g>
            <g id="button" mask="url(#mask-2)">
                <g transform="translate(24.000000, 383.000000)" id="button/primary">
                    <path d="M12,0 L315,0 C321.627417,-1.21743675e-15 327,5.372583 327,12 L327,38 C327,44.627417 321.627417,50 315,50 L12,50 C5.372583,50 8.11624501e-16,44.627417 0,38 L0,12 C-8.11624501e-16,5.372583 5.372583,1.21743675e-15 12,0 Z" id="button/primary-(Background)" fill="#3D5CFF"></path>
                    <g id="Frame-10" transform="translate(135.500000, 14.000000)" fill="#FFFFFF" font-family="Roboto" font-size="16" font-weight="normal">
                        <text id="회원가입">
                            <tspan x="0.32" y="14">회원가입</tspan>
                        </text>
                    </g>
                </g>
            </g>
            <g id="button-copy" mask="url(#mask-2)">
                <g transform="translate(24.000000, 486.000000)" id="button/primary">
                    <path d="M12,0 L315,0 C321.627417,-1.21743675e-15 327,5.372583 327,12 L327,38 C327,44.627417 321.627417,50 315,50 L12,50 C5.372583,50 8.11624501e-16,44.627417 0,38 L0,12 C-8.11624501e-16,5.372583 5.372583,1.21743675e-15 12,0 Z" id="button/primary-(Background)" fill="#21AF02"></path>
                    <g id="Frame-10" transform="translate(103.500000, 13.000000)" fill="#FFFFFF" font-family="Roboto" font-size="16" font-weight="normal">
                        <text id="네이버-간편-로그인">
                            <tspan x="0.1946875" y="14">네이버</tspan>
                            <tspan x="41.7146875" y="14" font-family="Helvetica"> </tspan>
                            <tspan x="46.16" y="14">간편</tspan>
                            <tspan x="73.84" y="14" font-family="Helvetica"> </tspan>
                            <tspan x="78.2853125" y="14">로그인</tspan>
                        </text>
                    </g>
                </g>
            </g>
            <g id="button-copy-2" mask="url(#mask-2)">
                <g transform="translate(23.000000, 546.000000)" id="button/primary">
                    <path d="M12,0 L315,0 C321.627417,-1.21743675e-15 327,5.372583 327,12 L327,38 C327,44.627417 321.627417,50 315,50 L12,50 C5.372583,50 8.11624501e-16,44.627417 0,38 L0,12 C-8.11624501e-16,5.372583 5.372583,1.21743675e-15 12,0 Z" id="button/primary-(Background)" fill="#7F7F7F"></path>
                    <g id="Frame-10" transform="translate(110.500000, 13.000000)" fill="#FFFFFF" font-family="Roboto" font-size="16" font-weight="normal">
                        <text id="구글-간편-로그인">
                            <tspan x="0.1146875" y="14">구글</tspan>
                            <tspan x="27.7946875" y="14" font-family="Helvetica"> </tspan>
                            <tspan x="32.24" y="14">간편</tspan>
                            <tspan x="59.92" y="14" font-family="Helvetica"> </tspan>
                            <tspan x="64.3653125" y="14">로그인</tspan>
                        </text>
                    </g>
                </g>
            </g>
            <g id="button-copy-3" mask="url(#mask-2)">
                <g transform="translate(24.000000, 606.000000)" id="button/primary">
                    <path d="M12,0 L315,0 C321.627417,-1.21743675e-15 327,5.372583 327,12 L327,38 C327,44.627417 321.627417,50 315,50 L12,50 C5.372583,50 8.11624501e-16,44.627417 0,38 L0,12 C-8.11624501e-16,5.372583 5.372583,1.21743675e-15 12,0 Z" id="button/primary-(Background)" fill="#FFDA0B"></path>
                    <g id="Frame-10" transform="translate(103.500000, 13.000000)" fill="#FFFFFF" font-family="Roboto" font-size="16" font-weight="normal">
                        <text id="카카오-간편-로그인">
                            <tspan x="0.1946875" y="14">카카오</tspan>
                            <tspan x="41.7146875" y="14" font-family="Helvetica"> </tspan>
                            <tspan x="46.16" y="14">간편</tspan>
                            <tspan x="73.84" y="14" font-family="Helvetica"> </tspan>
                            <tspan x="78.2853125" y="14">로그인</tspan>
                        </text>
                    </g>
                </g>
            </g>
            <g id="password" mask="url(#mask-2)">
                <g transform="translate(24.000000, 287.000000)" id="Form/password">
                    <path d="M0,0 L327.000061,0 L327.000061,72 L0,72 L0,0 Z" id="Form/password-(Background)"></path>
                    <g id="BG" transform="translate(0.000000, 22.000000)">
                        <use id="bg" stroke="#B8B8D2" mask="url(#mask-6)" fill="#FFFFFF" stroke-dasharray="0,0" xlink:href="#path-5"></use>
                        <g id="password" transform="translate(20.000000, 22.000000)" fill="#1F1F39">
                            <path d="M2.5,5 C3.88071187,5 5,3.88071187 5,2.5 C5,1.11928813 3.88071187,0 2.5,0 C1.11928813,0 0,1.11928813 0,2.5 C0,3.88071187 1.11928813,5 2.5,5 Z" id="Ellipse-15"></path>
                            <path d="M11.5,5 C12.8807119,5 14,3.88071187 14,2.5 C14,1.11928813 12.8807119,0 11.5,0 C10.1192881,0 9,1.11928813 9,2.5 C9,3.88071187 10.1192881,5 11.5,5 Z" id="Ellipse-15"></path>
                            <path d="M20.5,5 C21.8807119,5 23,3.88071187 23,2.5 C23,1.11928813 21.8807119,0 20.5,0 C19.1192881,0 18,1.11928813 18,2.5 C18,3.88071187 19.1192881,5 20.5,5 Z" id="Ellipse-15"></path>
                            <path d="M29.5,5 C30.8807119,5 32,3.88071187 32,2.5 C32,1.11928813 30.8807119,0 29.5,0 C28.1192881,0 27,1.11928813 27,2.5 C27,3.88071187 28.1192881,5 29.5,5 Z" id="Ellipse-15"></path>
                            <path d="M38.5,5 C39.8807119,5 41,3.88071187 41,2.5 C41,1.11928813 39.8807119,0 38.5,0 C37.1192881,0 36,1.11928813 36,2.5 C36,3.88071187 37.1192881,5 38.5,5 Z" id="Ellipse-15"></path>
                            <path d="M47.5,5 C48.8807119,5 50,3.88071187 50,2.5 C50,1.11928813 48.8807119,0 47.5,0 C46.1192881,0 45,1.11928813 45,2.5 C45,3.88071187 46.1192881,5 47.5,5 Z" id="Ellipse-15"></path>
                            <path d="M56.5,5 C57.8807119,5 59,3.88071187 59,2.5 C59,1.11928813 57.8807119,0 56.5,0 C55.1192881,0 54,1.11928813 54,2.5 C54,3.88071187 55.1192881,5 56.5,5 Z" id="Ellipse-15"></path>
                            <path d="M65.5,5 C66.8807119,5 68,3.88071187 68,2.5 C68,1.11928813 66.8807119,0 65.5,0 C64.1192881,0 63,1.11928813 63,2.5 C63,3.88071187 64.1192881,5 65.5,5 Z" id="Ellipse-15"></path>
                            <path d="M74.5,5 C75.8807119,5 77,3.88071187 77,2.5 C77,1.11928813 75.8807119,0 74.5,0 C73.1192881,0 72,1.11928813 72,2.5 C72,3.88071187 73.1192881,5 74.5,5 Z" id="Ellipse-15"></path>
                            <path d="M83.5,5 C84.8807119,5 86,3.88071187 86,2.5 C86,1.11928813 84.8807119,0 83.5,0 C82.1192881,0 81,1.11928813 81,2.5 C81,3.88071187 82.1192881,5 83.5,5 Z" id="Ellipse-15"></path>
                            <path d="M92.5,5 C93.8807119,5 95,3.88071187 95,2.5 C95,1.11928813 93.8807119,0 92.5,0 C91.1192881,0 90,1.11928813 90,2.5 C90,3.88071187 91.1192881,5 92.5,5 Z" id="Ellipse-15"></path>
                            <path d="M101.5,5 C102.880712,5 104,3.88071187 104,2.5 C104,1.11928813 102.880712,0 101.5,0 C100.119288,0 99,1.11928813 99,2.5 C99,3.88071187 100.119288,5 101.5,5 Z" id="Ellipse-15"></path>
                        </g>
                    </g>
                    <g id="title" fill="#858597" font-family="Helvetica" font-size="14" font-weight="normal">
                        <text id="Password">
                            <tspan x="0" y="14">Password</tspan>
                        </text>
                    </g>
                    <g id="icon/preview-close-one" transform="translate(283.000000, 37.000000)" fill="#1F1F39">
                        <path d="M3.08934097,1.91074946 L18.0893397,16.91075 C18.4147762,17.2361882 18.4147762,17.7638244 18.0893397,18.0892626 C17.7639015,18.4146992 17.2362653,18.4146992 16.9108272,18.0892626 L11.3875164,12.5659493 C10.9748886,12.7894358 10.5020163,12.9166726 10.0000849,12.9166726 C8.38926472,12.9166726 7.08341807,11.6108261 7.08341807,10.0000057 C7.08341807,9.4981759 7.21063066,9.02524917 7.43412859,8.61256128 L1.91082969,3.08926089 C1.5853928,2.76382397 1.5853928,2.23618638 1.91082969,1.91074946 C2.23626655,1.5853125 2.76390401,1.5853125 3.08934097,1.91074946 Z M8.75008499,10.0000057 C8.75008499,10.6903515 9.30973917,11.2500058 10.0000849,11.2500058 C10.0234451,11.2500058 10.0466488,11.24937 10.0696816,11.2481144 L8.75197485,9.93040736 C8.75071997,9.9534386 8.75008499,9.97664308 8.75008499,10.0000057 Z M8.54744511,6.01712371 C8.10076595,6.12800982 7.64876966,5.85579578 7.53788318,5.40911616 C7.42699709,4.96243653 7.69921068,4.51044017 8.14589024,4.39955387 C8.73890673,4.25234012 9.35940096,4.16667175 10.0000849,4.16667175 C12.5913831,4.16667175 14.8627474,5.56394321 16.4244438,6.85842188 C17.217114,7.51545943 17.8565192,8.17058605 18.2980767,8.6614204 C18.5193387,8.90737541 18.6921905,9.11349465 18.8110517,9.25988605 C18.8705133,9.3331195 18.9165535,9.39151775 18.9484746,9.43260681 C18.9644375,9.45315452 18.9768782,9.46938527 18.9857108,9.48098989 L18.9962425,9.49489367 L18.9994612,9.49917329 L19.0005531,9.5006332 C19.0007264,9.50086447 19.0013018,9.50163535 18.3334167,10.0000057 C19.0013002,10.4983801 19.0012239,10.498481 19.0011444,10.4985867 L19.0005516,10.4993814 L18.999458,10.5008413 L18.9962409,10.5051217 L18.9857076,10.5190247 C18.9768766,10.5306294 18.9644343,10.5468601 18.9484714,10.5674078 C18.9165503,10.6084969 18.8705101,10.6668951 18.8110485,10.7401278 C18.6921858,10.8865192 18.5193323,11.0926384 18.2980688,11.3385934 C17.8565096,11.8294274 17.2170997,12.4845532 16.4244279,13.1415904 C16.0700918,13.4352966 15.5447477,13.3861459 15.2510414,13.0318089 C14.9573352,12.6774712 15.006486,12.1521277 15.3608236,11.8584215 C16.0761938,11.2654585 16.6571801,10.6705843 17.0590059,10.2239181 C17.1308398,10.1440678 17.1967864,10.0691344 17.2565866,10.0000033 C17.196788,9.93087228 17.130843,9.85594128 17.0590091,9.77609092 C16.6571864,9.32942481 16.0762049,8.73455173 15.3608379,8.14158918 C13.9064617,6.93606767 12.0111613,5.83333874 10.0000849,5.83333874 C9.5086025,5.83333874 9.02326259,5.89900399 8.54744511,6.01712371 Z M19.0011444,10.4985867 C19.2217436,10.2029556 19.2219009,9.79726647 19.0013018,9.50163535 L18.3334167,10.0000057 L19.0011444,10.4985867 Z M4.63933101,8.14158839 C3.92396487,8.73455133 3.34298285,9.32942481 2.94116046,9.77609092 C2.86932614,9.85594208 2.80338076,9.93087466 2.74358121,10.0000057 C2.80338066,10.0691368 2.86932594,10.1440702 2.94116006,10.2239205 C3.34298235,10.6705866 3.92396407,11.2654593 4.63933141,11.8584223 C6.09370746,13.0639438 7.98900844,14.1666718 10.0000849,14.1666718 C10.4956641,14.1666718 10.9849641,14.0999219 11.4645208,13.9799584 C11.9110001,13.8682696 12.3634851,14.139671 12.4751739,14.5861504 C12.5868627,15.0326297 12.3154613,15.4851156 11.868982,15.5968044 C11.2715385,15.7462579 10.6460887,15.8333395 10.0000849,15.8333395 C7.40878668,15.8333395 5.13742096,14.4360682 3.57572436,13.1415896 C2.78305537,12.4845524 2.14364924,11.829425 1.70209265,11.338591 C1.48083067,11.092636 1.30797798,10.8865168 1.1891167,10.7401254 C1.1296558,10.6668919 1.08361569,10.6084937 1.05169452,10.5674046 C1.03573121,10.5468569 1.02329018,10.5306262 1.01445861,10.5190216 L1.00392597,10.5051178 L1.00070817,10.5008382 L0.99961482,10.4993782 C0.999442215,10.499147 0.998866484,10.4983761 1.66675202,10.0000057 C0.998866981,9.50163456 0.99894253,9.50153283 0.999021655,9.50142714 L1.00070866,9.49917329 L1.00392642,9.49489288 L1.01445906,9.48098989 C1.02329063,9.46938527 1.03573171,9.45315452 1.05169497,9.43260602 C1.08361619,9.39151696 1.1296563,9.3331195 1.18911724,9.25988605 C1.30797858,9.11349425 1.48083131,8.90737501 1.70209325,8.6614204 C2.14364973,8.17058645 2.78305537,7.51545982 3.57572238,6.85842268 C3.93005885,6.5647152 4.45540222,6.6138648 4.74910964,6.96820133 C5.04281687,7.32253785 4.99366728,7.84788091 4.63933101,8.14158839 Z M0.999021655,9.50142714 C0.778424238,9.79705745 0.778269365,10.2027458 0.998866484,10.4983761 L1.66675202,10.0000057 L0.999021655,9.50142714 Z" id="Vector-(Stroke)"></path>
                    </g>
                </g>
            </g>
            <g id="email" mask="url(#mask-2)">
                <g transform="translate(24.000000, 191.000000)" id="Form/email">
                    <path d="M0,0 L327.000061,0 L327.000061,72 L0,72 L0,0 Z" id="Form/email-(Background)"></path>
                    <use id="bg" stroke="#B8B8D2" mask="url(#mask-8)" fill="#FFFFFF" stroke-dasharray="0,0" xlink:href="#path-7"></use>
                    <g id="icon/check" transform="translate(283.000000, 37.000000)">
                        <path d="M17.2560851,6.42258902 L8.92275133,14.7559222 C8.59731476,15.0813595 8.06967698,15.0813595 7.7442404,14.7559222 L3.57757378,10.5892555 C3.25213685,10.2638189 3.25213685,9.7361811 3.57757378,9.41074451 C3.90301065,9.08530752 4.43064818,9.08530752 4.75608505,9.41074451 L8.33349609,12.9881557 L16.0775734,5.24407769 C16.4030099,4.91864075 16.9306485,4.91864075 17.2560851,5.24407769 C17.5815225,5.56951458 17.5815225,6.09715213 17.2560851,6.42258902 Z" id="Vector-(Stroke)"></path>
                    </g>
                    <g id="Email" transform="translate(20.000244, 37.000000)" fill="#1F1F39" font-family="Helvetica" font-size="14" font-weight="normal" line-spacing="20">
                        <text id="global-korea@gmail.com">
                            <tspan x="0" y="14">global-korea@gmail.com</tspan>
                        </text>
                    </g>
                    <g id="title" fill="#858597" font-family="Helvetica" font-size="14" font-weight="normal">
                        <text id="Your-Email">
                            <tspan x="0" y="14">Your  Email</tspan>
                        </text>
                    </g>
                </g>
            </g>
            <g id="title" mask="url(#mask-2)" font-family="Roboto" font-weight="normal">
                <g transform="translate(24.000000, 79.000000)">
                    <g id="text" stroke-width="1" fill-rule="evenodd" transform="translate(0.000000, 43.000000)" font-size="12" line-spacing="17">
                        <text id="이메일과-비밀번호를-입력해주세요" fill="#B8B8D2">
                            <tspan x="0" y="11">이메일과</tspan>
                            <tspan x="41.52" y="11" font-family="Helvetica"> </tspan>
                            <tspan x="44.8539844" y="11">비밀번호를</tspan>
                            <tspan x="96.7539844" y="11" font-family="Helvetica"> </tspan>
                            <tspan x="100.087969" y="11">입력해주세요</tspan>
                        </text>
                    </g>
                    <text id="회원가입" font-size="32" line-spacing="38">
                        <tspan x="0" y="29" fill="#1F1F39">회원가입</tspan>
                    </text>
                </g>
            </g>
        </g>
    </svg>
  </q-page>
</template>

<script>
import { defineComponent } from 'vue';

export default defineComponent({
  name: 'PageIndex',
  methods: {
    goTo(dest){
      this.$router.push({name: dest})
    }
  },
})
</script>
